let number = 2 + 2 * 2;
console.log(number);

/*
Правила названий переменных:

1. Понятные слова. u - нельзя, username - можно
2. Не писать сочинения. my_variable_which_i_would_printing - не надо.
3. ТОЛЬКО латиница. Не использовать символы кириллического алфавита
4. Можно использовать в названии цифры, но она не может быть первой
let var1 - можно
let g1_for - можно
let 5_obezyan - нельзя
5. Если нужно несколько слов, то делаем:
    a) CamelCase - каждое новое слово в названии с большой буквы MyDogsCount
    b) snake_case - слова разделяются знаком _ - my_dogs_count

*/

let minute = 60;  // количество секунд в минуте
let hour = 60; // количество минут в часе
let seconds_in_hour = hour * minute;
console.log('Секунд в часе: ', seconds_in_hour);
// переменная инициализирована через другие переменные
